arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/power/fsl_power_manager.c
/*
 * Copyright (c) 2014, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_power_manager.h"
#include "fsl_smc_hal.h"
#include "fsl_pmc_hal.h"
#include "fsl_rcm_hal.h"
#include "fsl_sim_hal.h"
#include "fsl_clock_manager.h"
#include <string.h>



/*******************************************************************************
 * Internal Variables
 ******************************************************************************/

/*! @brief Power manager internal structure. */
static power_manager_state_t gPowerManagerState;

#ifdef USE_RTOS
#if (USE_RTOS)
/*! @brief Power manager internal structure lock. */
mutex_t gPowerManagerStateSync;
#endif
#endif

/*******************************************************************************
 * PROTOTYPES
 ******************************************************************************/

static power_manager_error_code_t POWER_SYS_WaitForModeStatus(smc_run_mode_t mode);
static power_manager_error_code_t POWER_SYS_CallbacksManagement(power_manager_notify_struct_t *notifyStruct, uint8_t *currentStaticCallback, power_manager_policy_t policy);
static power_manager_error_code_t POWER_SYS_SwitchToSleepingPowerMode(const power_manager_user_config_t* const configPtr);
static power_manager_error_code_t POWER_SYS_SwitchToRunningPowerMode(const power_manager_user_config_t* const configPtr);
static power_manager_error_code_t POWER_SYS_CheckPowerModeIndex(uint8_t powerModeIndex);

/*!
 * @brief Macros for power manager lock mechanism.
 *
 * Mutex is used when operating system is present otherwise critical section
 * (global interrupt disable).
 *
 */
#ifdef USE_RTOS
#if (USE_RTOS)
  #define POWER_SYS_LOCK_INIT()    OSA_MutexCreate(&gPowerManagerStateSync)
  #define POWER_SYS_LOCK()         OSA_MutexLock(&gPowerManagerStateSync, OSA_WAIT_FOREVER)
  #define POWER_SYS_UNLOCK()       OSA_MutexUnlock(&gPowerManagerStateSync)
  #define POWER_SYS_LOCK_DEINIT()  OSA_MutexDestroy(&gPowerManagerStateSync)
#else
  #define POWER_SYS_LOCK_INIT()    do {}while(0)
  #define POWER_SYS_LOCK()         do {}while(0)
  #define POWER_SYS_UNLOCK()       do {}while(0)
  #define POWER_SYS_LOCK_DEINIT()  do {}while(0)
#endif
#else
  #define POWER_SYS_LOCK_INIT()    do {}while(0)
  #define POWER_SYS_LOCK()         do {}while(0)
  #define POWER_SYS_UNLOCK()       do {}while(0)
  #define POWER_SYS_LOCK_DEINIT()  do {}while(0)
#endif

/*! Timeout used for waiting to set new mode */
#define POWER_SET_MODE_TIMEOUT 1000U
/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : POWER_SYS_Init
 * Description   : Initializes the Power manager for operation.
 * This function initializes the Power manager and its run-time state structure.
 * Reference to an array of Power mode configuration structures has to be passed
 * as parameter along with parameter specifying its size. At least one power mode
 * configuration is required. Optionally, reference to array of predefined
 * call-backs can be passed with its size parameter.
 * For details about call-backs refer to the power_manager_callback_user_config_t.
 * As Power manager stores only references to array of these structures they have
 * to exist while Power manager is used.
 * It is expected that prior POWER_SYS_Init() call the write-once protection
 * register was configured appropriately allowing to enter all required low power
 * modes.
 * The following is an example of how to set up two power modes and three
 * call-backs and initialize the Power manager with structures containing their settings.
 * The example shows two possible ways how where the configuration structures can be stored
 * (ROM or RAM) although it is expected that they will be placed rather in the read-only
 * memory to save the RAM space. (Note: In the example it is assumed that the programmed chip
 * doesn't support any optional power options described in the power_manager_user_config_t)
 *
 *END**************************************************************************/
power_manager_error_code_t POWER_SYS_Init(power_manager_user_config_t const * (* powerConfigsPtr)[],
                                          uint8_t configsNumber,
                                          power_manager_callback_user_config_t const * (* callbacksPtr)[],
                                          uint8_t callbacksNumber)
{
  power_manager_error_code_t returnCode; /* Function return */

