arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/power/fsl_power_manager.c
  /* Check input parameter - at least one power mode configuration is required */
  if ((powerConfigsPtr == NULL) || (configsNumber == 0U))
  {
    returnCode = POWER_MAN_ERR;
  }
  else
  {
    returnCode = POWER_MAN_SUCCESS;
  }
  /* Initialize internal state structure lock */
  POWER_SYS_LOCK_INIT();
  POWER_SYS_LOCK();

  /* Store references to user-defined power mode configurations */
  gPowerManagerState.configs = (power_manager_user_config_t *(*)[])powerConfigsPtr;
  gPowerManagerState.configsNumber = configsNumber;
  gPowerManagerState.currentConfig = 0U;
  /* Store references to user-defined callback configurations and increment call-back handle counter */
  if (callbacksPtr != NULL)
  {
    gPowerManagerState.staticCallbacks = (power_manager_callback_user_config_t *(*)[])callbacksPtr;
    gPowerManagerState.staticCallbacksNumber = callbacksNumber;
    /* Default value of handle of last call-back that returned error */
    gPowerManagerState.errorCallbackIndex = callbacksNumber;
  }
  else
  {
    gPowerManagerState.staticCallbacks = NULL;
    gPowerManagerState.staticCallbacksNumber = 0U;
    gPowerManagerState.errorCallbackIndex = 0U;
  }

  POWER_SYS_UNLOCK();

  return returnCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : POWER_SYS_Deinit
 * Description   : Deinitializes the Power manager.
 *
 *END**************************************************************************/
power_manager_error_code_t POWER_SYS_Deinit(void)
{
  /* Deinitialize internal state structure lock */
  POWER_SYS_LOCK_DEINIT();
  return POWER_MAN_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : POWER_SYS_SetMode
 * Description   : Configures the power mode.
 *
 * This function switches to one of the defined power modes. Requested mode number is passed
 * as an input parameter. This function notifies all registered callback functions before
 * the mode change (using  POWER_MANAGER_CALLBACK_BEFORE set as callback type parameter),
 * sets specific power options defined in the power mode configuration and enters the specified
 * mode. In case of run modes (for example, Run, Very low power run, or High speed run), this function
 * also invokes all registered callbacks after the mode change (using POWER_MANAGER_CALLBACK_AFTER).
 * In case of sleep or deep sleep modes, if the requested mode is not exited through
 * a reset, these notifications are sent after the core wakes up.
 * Callbacks are invoked in the following order: All registered callbacks are notified
 * ordered by index in the callbacks array (see callbacksPtr parameter of POWER_SYS_Init()).
 * The same order is used for before and after switch notifications.
 * The notifications before the power mode switch can be used to obtain confirmation about
 * the change from registered callbacks. If any registered callback denies the power
 * mode change, further execution of this function depends on mode change policy: the mode
 * change is either forced (POWER_MANAGER_POLICY_FORCIBLE) or exited (POWER_MANAGER_POLICY_AGREEMENT).
 * When mode change is forced, the result of the before switch notifications are ignored. If
 * agreement is required, if any callback returns an error code then further notifications
 * before switch notifications are cancelled and all already notified callbacks are re-invoked
 * with POWER_MANAGER_CALLBACK_AFTER set as callback type parameter. The index of the callback
 * which returned error code during pre-switch notifications is stored (any error codes during
 * callbacks re-invocation are ignored) and POWER_SYS_GetErrorCallback() can be used to get it.
 * Regardless of the policies, if any callback returned an error code, an error code denoting in which phase
 * the error occurred is returned when POWER_SYS_SetMode() exits.
 * It is possible to enter any mode supported by the processor. Refer to the chip reference manual
 * for list of available power modes. If it is necessary to switch into intermediate power mode prior to
 * entering requested mode (for example, when switching from Run into Very low power wait through Very low
 * power run mode), then the intermediate mode is entered without invoking the callback mechanism.
 *
 *END**************************************************************************/
power_manager_error_code_t POWER_SYS_SetMode(uint8_t powerModeIndex, power_manager_policy_t policy)
{
  power_manager_user_config_t * configPtr; /* Local pointer to the requested user-defined power mode configuration */
  power_manager_error_code_t returnCode; /* Function return */

  POWER_SYS_LOCK();

  /* Default value of handle of last call-back that returned error */
  gPowerManagerState.errorCallbackIndex = gPowerManagerState.staticCallbacksNumber;

  /* Initialization of local pointer to the requested user-defined power mode configuration */
  configPtr = (*gPowerManagerState.configs)[powerModeIndex];

  POWER_SYS_UNLOCK();

  /* Check the power mode index parameter */
  returnCode = POWER_SYS_CheckPowerModeIndex(powerModeIndex);
  if (POWER_MAN_SUCCESS != returnCode)
  {
    return returnCode;
  }

  bool successfulSwitch;                                 /* Power mode switch is successful or not */
  uint8_t currentStaticCallback = 0U;                    /* Index to array of statically registered call-backs */
  power_manager_notify_struct_t notifyStruct;            /* Callback notification structure */
  
  /* Set the transaction policy in the notification structure */
  notifyStruct.policy = policy;
  
  /* Set the target power mode configuration in the notification structure */
  notifyStruct.targetPowerConfigIndex = powerModeIndex;
  notifyStruct.targetPowerConfigPtr = configPtr;
  
  /* Notify those which asked to be called before the power mode change */
  notifyStruct.notifyType = POWER_MANAGER_NOTIFY_BEFORE;
  returnCode = POWER_SYS_CallbacksManagement(&notifyStruct,&currentStaticCallback,policy);
  
