arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/power/fsl_power_manager.c
  /* Power mode switch */
  
  /* In case that any call-back returned error code and  policy doesn't force the mode switch go to after switch call-backs */
  if ((policy == POWER_MANAGER_POLICY_FORCIBLE) || (returnCode == POWER_MAN_SUCCESS))
  {
    /* Check whether the power mode is a sleeping or a running power mode */
    if (configPtr->powerMode >= POWER_MANAGER_WAIT)
    {
      /* Switch to a sleeping power mode */
      returnCode = POWER_SYS_SwitchToSleepingPowerMode(configPtr);
    }
    else
    {
      /* Switch to a running power mode */
      returnCode = POWER_SYS_SwitchToRunningPowerMode(configPtr);
    }
    successfulSwitch = (POWER_MAN_SUCCESS == returnCode);
  }
  else
  {
    /* Unsuccessful switch */
    successfulSwitch = false;
  }
  
  if (successfulSwitch)
  {
    /* End of successful switch */
  
    POWER_SYS_LOCK();
  
    /* Update current configuration index */
    gPowerManagerState.currentConfig = powerModeIndex;
  
    POWER_SYS_UNLOCK();
  
    /* Notify those which asked to be called after the power mode change */
    notifyStruct.notifyType = POWER_MANAGER_NOTIFY_AFTER;
    returnCode = POWER_SYS_CallbacksManagement(&notifyStruct,&currentStaticCallback,POWER_MANAGER_POLICY_FORCIBLE);
  }
  else
  {
    /* End of unsuccessful switch */
  
    /* Notify those which have been called before the power mode change */
    notifyStruct.notifyType = POWER_MANAGER_NOTIFY_RECOVER;
    POWER_SYS_CallbacksManagement(&notifyStruct,&currentStaticCallback,POWER_MANAGER_POLICY_FORCIBLE);
  }
  return returnCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : POWER_SYS_GetLastModeIndex
 * Description   : This function returns power mode set as the last one.
 *
 * This function returns index of power mode which was set using POWER_SYS_SetMode() as the last one.
 * If the power mode was entered although some of the registered call-back denied the mode change
 * or if any of the call-backs invoked after the entering/restoring run mode failed then the return
 * code of this function has POWER_MAN_ERR value.
 * value.
 *
 *END**************************************************************************/
power_manager_error_code_t POWER_SYS_GetLastMode(uint8_t* const powerModeIndexPtr)
{
  power_manager_error_code_t returnCode; /* Function return */
  POWER_SYS_LOCK();
  /* Pass index of user-defined configuration structure of currently running power mode */
  *powerModeIndexPtr = gPowerManagerState.currentConfig;
  /* Return whether all call-backs executed without error */
  if (gPowerManagerState.errorCallbackIndex == gPowerManagerState.staticCallbacksNumber)
  {
    returnCode = POWER_MAN_SUCCESS;
  }
  else
  {
    returnCode = POWER_MAN_ERR;
  }
  POWER_SYS_UNLOCK();
  return returnCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : POWER_SYS_GetLastModeConfig
 * Description   : This function returns user configuration structure of power mode set as the last one.
 *
 * This function returns reference to configuration structure which was set using POWER_SYS_SetMode()
 * as the last one. If the current power mode was entered although some of the registered call-back denied
 * the mode change or if any of the call-backs invoked after the entering/restoring run mode failed then
 * the return code of this function has POWER_MAN_ERR value.
 *
 *END**************************************************************************/
power_manager_error_code_t POWER_SYS_GetLastModeConfig(power_manager_user_config_t** const powerModePtr)
{
  power_manager_error_code_t returnCode; /* Function return */
  POWER_SYS_LOCK();
  /* Pass reference to user-defined configuration structure of currently running power mode */
  *powerModePtr = (*gPowerManagerState.configs)[gPowerManagerState.currentConfig];
  /* Return whether all call-backs executed without error */
  if (gPowerManagerState.errorCallbackIndex == gPowerManagerState.staticCallbacksNumber)
  {
    returnCode = POWER_MAN_SUCCESS;
  }
  else
  {
    returnCode = POWER_MAN_ERR;
  }
  POWER_SYS_UNLOCK();
  return returnCode;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : POWER_SYS_GetCurrentMode
 * Description   : Returns currently running power mode.
 *
 *END**************************************************************************/
power_manager_modes_t POWER_SYS_GetCurrentMode(void)
{
  power_manager_modes_t retVal;
  switch (SMC_HAL_GetPowerModeStatus(SMC))
  {
#if FSL_FEATURE_SMC_HAS_HIGH_SPEED_RUN_MODE
    /* High speed run mode */
    case STAT_HSRUN:
      retVal = POWER_MANAGER_HSRUN;
      break;
#endif
    /* Run mode */
    case STAT_RUN:
      retVal = POWER_MANAGER_RUN;
      break;
    /* Very low power run mode */
    case STAT_VLPR:
      retVal = POWER_MANAGER_VLPR;
      break;
    /* This should never happen - core has to be in some run mode to execute code */
    default:
      retVal = POWER_MANAGER_MAX;
      break;
  }
  return retVal;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : POWER_SYS_GetErrorCallbackIndex
 * Description   : Returns the last failed notification callback.
 *
 * This function returns index of the last call-back that failed during the power mode switch while
 * the last POWER_SYS_SetMode() was called. If the last POWER_SYS_SetMode() call ended successfully
 * value equal to callbacks number is returned. Returned value represents index in the array of
 * static call-backs.
 *
 *END**************************************************************************/
uint8_t POWER_SYS_GetErrorCallbackIndex (void)
{
  return gPowerManagerState.errorCallbackIndex;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : POWER_SYS_GetErrorCallback
 * Description   : Get the callback which returns error in last mode switch.
 *
 *END**************************************************************************/
power_manager_callback_user_config_t* POWER_SYS_GetErrorCallback(void) {
  /* If all callbacks return success. */
  return (gPowerManagerState.errorCallbackIndex
      >= gPowerManagerState.staticCallbacksNumber) ?
      NULL :
      (*gPowerManagerState.staticCallbacks)[gPowerManagerState.errorCallbackIndex];
}

/*FUNCTION**************************************************************************
 * Function Name : POWER_SYS_WaitForRunStatus
 * Description   :Internal function used by POWER_SYS_SwitchToSleepingPowerMode and
 *                POWER_SYS_SwitchToRunningPowerMode functions
 * mode           The expected running mode
 *
 *END*******************************************************************************/
static power_manager_error_code_t POWER_SYS_WaitForModeStatus(smc_run_mode_t mode)
{
  power_manager_error_code_t retCode;
  power_mode_stat_t modeStat;
  uint32_t i = 0U;

  switch(mode)
  {
    case SMC_RUN:
      modeStat = STAT_RUN;
      retCode = POWER_MAN_SUCCESS;
      break;
    case SMC_VLPR:
      modeStat = STAT_VLPR;
      retCode = POWER_MAN_SUCCESS;
      break;
#if FSL_FEATURE_SMC_HAS_HIGH_SPEED_RUN_MODE
    case SMC_HSRUN:
      modeStat = STAT_HSRUN;
      retCode = POWER_MAN_SUCCESS;
      break;
#endif
    default:
      /* invalid parameter */
      modeStat = STAT_INVALID;
      retCode = POWER_MAN_ERR;
      break;
  }
  if (POWER_MAN_SUCCESS == retCode)
  {
    for (; i < POWER_SET_MODE_TIMEOUT ; i++)
    {
      if(SMC_HAL_GetPowerModeStatus(SMC) == modeStat)
      {
        break;
      }
    }
  }
  if (i >= POWER_SET_MODE_TIMEOUT)
  {
    retCode = POWER_MAN_ERR_SWITCH;
  }
  return retCode;
}


/*FUNCTION**********************************************************************************************
 * Function Name : POWER_SYS_SwitchToRunningPowerMode
 * Description   :Internal function used by POWER_SYS_SetMode function to switch to a running power mode
 * configPtr   pointer to the requested user-defined power mode configuration
 *
 *END***************************************************************************************************/
static power_manager_error_code_t POWER_SYS_SwitchToRunningPowerMode(const power_manager_user_config_t* const configPtr)
{
  smc_power_mode_config_t halModeConfig; /* SMC HAL layer configuration structure */
  power_manager_error_code_t returnCode;

