arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/power/fsl_power_manager.c
  /* Configure the HAL layer */
  switch (configPtr->powerMode) {
#if FSL_FEATURE_SMC_HAS_HIGH_SPEED_RUN_MODE
  /* High speed run mode */
  case POWER_MANAGER_HSRUN:
    /* High speed run mode can be entered only from Run mode */
    if (SMC_HAL_GetPowerModeStatus(SMC) != STAT_RUN)
    {
      SMC_HAL_SetRunModeControl(SMC, SMC_RUN);
      returnCode = POWER_SYS_WaitForModeStatus(SMC_RUN);
    }
    else
    {
      returnCode = POWER_MAN_SUCCESS;
    }
    if (POWER_MAN_SUCCESS == returnCode)
    {
      halModeConfig.powerModeName = POWER_MODE_HSRUN;

      /* Switch the mode */
      if (SMC_HAL_SetPowerMode(SMC, &halModeConfig) == SMC_HAL_SUCCESS)
      {
        returnCode = POWER_SYS_WaitForModeStatus(SMC_HSRUN);
      }
      else
      {
        returnCode = POWER_MAN_ERR_SWITCH;
      }
    }
    break;
#endif
  /* Run mode */
  case POWER_MANAGER_RUN:
    halModeConfig.powerModeName = POWER_MODE_RUN;
    returnCode = POWER_MAN_SUCCESS;
    /* Switch the mode */
    if (SMC_HAL_SetPowerMode(SMC, &halModeConfig) == SMC_HAL_SUCCESS)
    {
      returnCode = POWER_SYS_WaitForModeStatus(SMC_RUN);
    }
    else
    {
      returnCode = POWER_MAN_ERR_SWITCH;
    }
    break;
  /* Very low power run mode */
  case POWER_MANAGER_VLPR:
    /* Very low power run mode can be entered only from Run mode */
    if (SMC_HAL_GetPowerModeStatus(SMC) != STAT_RUN)
    {
      SMC_HAL_SetRunModeControl(SMC, SMC_RUN);
      returnCode = POWER_SYS_WaitForModeStatus(SMC_RUN);
    }
    else
    {
      returnCode = POWER_MAN_SUCCESS;
    }

    if (POWER_MAN_SUCCESS == returnCode)
    {
      halModeConfig.powerModeName = POWER_MODE_VLPR;

      /* Switch the mode */
      if (SMC_HAL_SetPowerMode(SMC, &halModeConfig) == SMC_HAL_SUCCESS)
      {
        returnCode = POWER_SYS_WaitForModeStatus(SMC_VLPR);
      }
      else
      {
        returnCode = POWER_MAN_ERR_SWITCH;
      }
    }
    break;
  /* Wait mode */
  default:
    /* invalid power mode */
    returnCode = POWER_MAN_ERR_SWITCH;
    halModeConfig.powerModeName = POWER_MODE_MAX;
    break;
  }

  return returnCode;
}


/*FUNCTION**********************************************************************************************
 * Function Name : POWER_SYS_SwitchToSleepingPowerMode
 * Description   :Internal function used by POWER_SYS_SetMode function to switch to a sleeping power mode
 * configPtr   pointer to the requested user-defined power mode configuration
 *
 *END***************************************************************************************************/
static power_manager_error_code_t POWER_SYS_SwitchToSleepingPowerMode(const power_manager_user_config_t* const configPtr)
{
  smc_power_mode_config_t halModeConfig; /* SMC HAL layer configuration structure */
  power_manager_error_code_t returnCode;

  /* Configure the HAL layer */
  switch (configPtr->powerMode) {
  /* Wait mode */
  case POWER_MANAGER_WAIT:
    /* Wait mode can be entered only from Run mode */
    if (SMC_HAL_GetPowerModeStatus(SMC) != STAT_RUN)
    {
      SMC_HAL_SetRunModeControl(SMC, SMC_RUN);
      returnCode = POWER_SYS_WaitForModeStatus(SMC_RUN);
    }
    else
    {
      returnCode = POWER_MAN_SUCCESS;
    }
    halModeConfig.powerModeName = POWER_MODE_WAIT;
    break;
  /* Very low power wait mode */
  case POWER_MANAGER_VLPW:
    /* Very low power wait mode can be netered only from Very low power run mode */
    if (SMC_HAL_GetPowerModeStatus(SMC) != STAT_VLPR)
    {
      SMC_HAL_SetRunModeControl(SMC, SMC_VLPR);
      returnCode = POWER_SYS_WaitForModeStatus(SMC_VLPR);
    }
    else
    {
      returnCode = POWER_MAN_SUCCESS;
    }
    halModeConfig.powerModeName = POWER_MODE_VLPW;
    break;
#if FSL_FEATURE_SMC_HAS_PSTOPO
    /* Partial stop modes */
  case POWER_MANAGER_PSTOP1:
    /* fall-through */
  case POWER_MANAGER_PSTOP2:
    /* fall-through */
#endif
  /* Stop mode */
  case POWER_MANAGER_STOP:
    /* Stop mode can be entered only from Run mode */
    if (SMC_HAL_GetPowerModeStatus(SMC) != STAT_RUN)
    {
      SMC_HAL_SetRunModeControl(SMC, SMC_RUN);
      returnCode = POWER_SYS_WaitForModeStatus(SMC_RUN);
    }
    else
    {
      returnCode = POWER_MAN_SUCCESS;
    }
    halModeConfig.powerModeName = POWER_MODE_STOP;
#if FSL_FEATURE_SMC_HAS_PSTOPO
    halModeConfig.pstopOption = true;
    /* Set the partial stop option value */
    if (POWER_MANAGER_PSTOP1 == configPtr->powerMode)
    {
      halModeConfig.pstopOptionValue = SMC_PSTOP_STOP1;
    }
    else if(POWER_MANAGER_PSTOP2 == configPtr->powerMode)
    {
      halModeConfig.pstopOptionValue = SMC_PSTOP_STOP2;
    }
    else
    {
      halModeConfig.pstopOptionValue = SMC_PSTOP_STOP;
    }
#endif
      break;
  /* Very low power stop mode */
  case POWER_MANAGER_VLPS:
    /* Very low power stop mode can be entered only from Run mode or Very low power run mode*/
    if ((SMC_HAL_GetPowerModeStatus(SMC) != STAT_RUN) && (SMC_HAL_GetPowerModeStatus(SMC) != STAT_VLPR))
    {
      SMC_HAL_SetRunModeControl(SMC, SMC_RUN);
      returnCode = POWER_SYS_WaitForModeStatus(SMC_RUN);
    }
    else
    {
      returnCode = POWER_MAN_SUCCESS;
    }
    halModeConfig.powerModeName = POWER_MODE_VLPS;
    break;
  default:
    /* invalid power mode */
    returnCode = POWER_MAN_ERR_SWITCH;
    halModeConfig.powerModeName = POWER_MODE_MAX;
    break;
  }

  if (POWER_MAN_SUCCESS == returnCode)
  {
    /* Configure ARM core what to do after interrupt invoked in (deep) sleep state */
    if ((configPtr->sleepOnExitOption) && (configPtr->powerMode >= POWER_MANAGER_WAIT))
    {
      if (configPtr->sleepOnExitValue)
      {
        /* Go back to (deep) sleep state on ISR exit */
        FSL_SCB->SCR |= FSL_SCB_SCR_SLEEPONEXIT_MASK;
      }
      else
      {
        /* Do not re-enter (deep) sleep state on ISR exit */
        FSL_SCB->SCR &= ~(FSL_SCB_SCR_SLEEPONEXIT_MASK);
      }
    }

    /* Switch the mode */
    if (SMC_HAL_SetPowerMode(SMC, &halModeConfig) != SMC_HAL_SUCCESS)
    {
      returnCode = POWER_MAN_ERR_SWITCH;
    }
  }
  return returnCode;
}

/*FUNCTION**********************************************************************************************
 * Function Name : POWER_SYS_CallbacksManagement
 * Description   : Internal function used by POWER_SYS_SetMode function for callback management
 * notifyStruct            callback notification structure
 * currentStaticCallback   index to array of statically registered call-backs
 * policy                  transaction policy
 *
 *END***************************************************************************************************/
static power_manager_error_code_t POWER_SYS_CallbacksManagement(power_manager_notify_struct_t *notifyStruct, uint8_t *currentStaticCallback, power_manager_policy_t policy)
{
  uint8_t callbacksNumber = 0;                               /* The total number of callbacks */
  power_manager_callback_user_config_t * callbackConfig;     /* Pointer to callback configuration */
  power_manager_error_code_t returnCode = POWER_MAN_SUCCESS; /* Function return */
  power_manager_error_code_t errorCode;                      /* Error code to be returned (error case) */
  power_manager_callback_type_t callbackTypeFilter;          /* Callback types to be excluded */

  POWER_SYS_LOCK();

