arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/power/fsl_power_manager.c
  switch(notifyStruct->notifyType)
  {
    /* notify before */
    case POWER_MANAGER_NOTIFY_BEFORE:
      callbacksNumber = gPowerManagerState.staticCallbacksNumber;
      callbackTypeFilter = POWER_MANAGER_CALLBACK_AFTER;
      errorCode = POWER_MAN_ERR_NOTIFY_BEFORE;
      break;
    /* notify after */
    case POWER_MANAGER_NOTIFY_AFTER:
      callbacksNumber = gPowerManagerState.staticCallbacksNumber;
      callbackTypeFilter = POWER_MANAGER_CALLBACK_BEFORE;
      errorCode = POWER_MAN_ERR_NOTIFY_AFTER;
      break;
     /* notify recover */
    case POWER_MANAGER_NOTIFY_RECOVER:
      callbacksNumber = *currentStaticCallback;
      callbackTypeFilter = POWER_MANAGER_CALLBACK_AFTER;
      errorCode = POWER_MAN_ERR_NOTIFY_BEFORE;
      break;
    default:
    /* nothing to execute */
    break;
  }

  /* From all statically registered call-backs... */
  for ((*currentStaticCallback) = 0U; (*currentStaticCallback) < callbacksNumber; (*currentStaticCallback)++)
  {
    callbackConfig = ((*gPowerManagerState.staticCallbacks)[*currentStaticCallback]);
    /* Check pointer to static callback configuration */
    if ( callbackConfig != NULL ){
      /* ...notify only those which asked to be called */
      if ( callbackTypeFilter != callbackConfig->callbackType)
      {
        /* In case that call-back returned error code mark it, store the call-back handle and eventually cancel the mode switch */
        if (POWER_MAN_SUCCESS != ((power_manager_error_code_t)(callbackConfig->callbackFunction(notifyStruct, callbackConfig->callbackData))))
        {
          returnCode = errorCode;
          gPowerManagerState.errorCallbackIndex = *currentStaticCallback;
          /* If not forcing power mode switch, call all already notified call-backs to revert their state as the mode change is canceled */
          if (policy != POWER_MANAGER_POLICY_FORCIBLE)
          {
            break;
          }
        }
      }
    }
  }

  POWER_SYS_UNLOCK();

  return returnCode;
}

/*FUNCTION**********************************************************************************************
 * Function Name : POWER_SYS_CallbacksManagement
 * Description   : Internal function used by POWER_SYS_SetMode function for power mode index parameter checking
 * powerModeIndex          Requested power mode represented as an index into
 *
 *END***************************************************************************************************/
static power_manager_error_code_t POWER_SYS_CheckPowerModeIndex(uint8_t powerModeIndex)
{
  power_manager_user_config_t* configPtr;  /* Local pointer to the requested user-defined power mode configuration */
  power_manager_error_code_t returnCode;   /* Function return */

  POWER_SYS_LOCK();

  /* Initialization of local pointer to the requested user-defined power mode configuration */
  configPtr = (*gPowerManagerState.configs)[powerModeIndex];

  /* Requested power mode configuration availability check */
  if (powerModeIndex >= gPowerManagerState.configsNumber)
  {
    returnCode = POWER_MAN_ERR_OUT_OF_RANGE;
  }
  /* Check that pointer to the requested user-defined power mode configuration is valid */
  else if (configPtr == NULL)
  {
    returnCode = POWER_MAN_ERR;
  }
  /* Check that the requested power mode is not protected */
  else if( ((configPtr->powerMode == POWER_MANAGER_VLPR) ||
      (configPtr->powerMode == POWER_MANAGER_VLPW) ||
      (configPtr->powerMode == POWER_MANAGER_VLPS)) &&
    (SMC_HAL_GetProtectionMode(SMC, ALLOW_VLP) == false) )
  {
    returnCode = POWER_MAN_ERR_PROTECTION;
  }
#if FSL_FEATURE_SMC_HAS_HIGH_SPEED_RUN_MODE
  else if( (configPtr->powerMode == POWER_MANAGER_HSRUN) &&
    (SMC_HAL_GetProtectionMode(SMC, ALLOW_HSRUN) == false) )
  {
    returnCode = POWER_MAN_ERR_PROTECTION;
  }
#endif
  else
  {
    returnCode = POWER_MAN_SUCCESS;
  }
  POWER_SYS_UNLOCK();
  return returnCode;
}


/*******************************************************************************
 * EOF
 ******************************************************************************/

